namespace weaponList {
    export const heavybowgun = {
        "ベルダーキャノン": {
            lastName: 'サージュキャノン',
            list: [
                [80, 0],
                [90, 0],
                [100, 0],
                [110, 0],
                [120, 0],
                [160, 0],
                [180, 0],
                [200, 0],
            ]
        },
        "ガウプシカ": {
            lastName: 'ヘビィガウプシカ',
            list: [
                [100, 0],
                [110, 0],
                [130, 0],
                [160, 0],
                [190, 0],
            ]
        },
        "キャロムボール": {
            lastName: '転弩エイトボール',
            list: [
                [130, 0],
                [150, 0],
                [180, 0],
                [200, 0],
            ]
        },
        "アグナブロウ": {
            lastName: '炎戈銃ブレイズヘル',
            list: [
                [200, 5],
                [210, 5],
                [220, 5],
            ]
        },
        "サンドダイバー": {
            lastName: 'デザートダイバー',
            list: [
                [90, 0],
                [100, 0],
                [120, 0],
                [150, 0],
                [180, 0],
                [190, 0],
            ]
        },
        "ガノスプレッシャー": {
            lastName: 'ガノバッシャーガン',
            list: [
                [180, 5],
                [190, 5],
                [210, 5],
            ]
        },
        "ラピッドキャスト": {
            lastName: 'ハイサイクルキャスト',
            list: [
                [150, 0],
                [180, 0],
                [190, 0],
            ]
        },
        "バスタークラブ": {
            lastName: 'ヘビィバスタークラブ',
            list: [
                [110, 0],
                [130, 0],
                [160, 0],
                [190, 0],
                [200, 0],
            ]
        },
        "スレイペンギーゴ": {
            lastName: 'スレイペンギング',
            list: [
                [110, 0],
                [120, 0],
                [140, 0],
                [180, 0],
                [200, 0],
            ]
        },
        "ヒドゥンスナイパー": {
            lastName: '夜砲【黒鳳】',
            list: [
                [110, 20],
                [120, 20],
                [150, 30],
                [180, 30],
                [190, 30],
            ]
        },
        "ピアースクラブ": {
            lastName: 'ウチヌキ',
            list: [
                [190, 0],
                [200, 0],
                [210, 0],
            ]
        },
        "オブシドキャノン": {
            lastName: '歴耀砲カボニフェル',
            list: [
                [140, 10],
                [180, 10],
                [190, 10],
                [210, 10],
            ]
        },
        "チャージグリフサルト": {
            lastName: '徹甲砲アルセルタス',
            list: [
                [160, 0],
                [200, 0],
                [220, 0],
            ]
        },
        "妃竜砲【遠撃】": {
            lastName: '妃竜砲【飛撃】',
            list: [
                [180, 0],
                [190, 0],
                [210, 0],
            ]
        },
        "アルバレスト": {
            lastName: 'S・アルバレスト',
            list: [
                [90, 0],
                [100, 0],
                [110, 0],
                [120, 0],
                [130, 0],
                [140, 0],
                [170, 0],
                [190, 0],
            ]
        },
        "インジェクションガン": {
            lastName: 'ゼクトインジェクト',
            list: [
                [100, 0],
                [110, 0],
                [130, 0],
                [170, 0],
                [190, 0],
            ]
        },
        "ラストニードル": {
            lastName: 'ハニーコーマー',
            list: [
                [150, 0],
                [170, 0],
                [180, 0],
            ]
        },
        "メテオバズーカ": {
            lastName: 'メテオフォール',
            list: [
                [100, 0],
                [110, 0],
                [120, 0],
                [150, 0],
                [190, 0],
            ]
        },
        "バイトブラスター": {
            lastName: 'バイティングブラスト',
            list: [
                [130, 0],
                [150, 0],
                [180, 0],
                [200, 0],
            ]
        },
        "サイドアルシャマリ": {
            lastName: '叛砲アルシャマリ',
            list: [
                [150, 10],
                [160, 10],
                [200, 10],
                [210, 10],
            ]
        },
        "叛逆の怒砲": {
            lastName: '叛逆砲イーラレギオン',
            list: [
                [210, 10],
                [220, 10],
                [230, 10],
            ]
        },
        "討伐隊正式重砲": {
            lastName: '近衛隊正式重砲',
            list: [
                [150, 0],
                [190, 0],
                [210, 0],
            ]
        },
        "メテオバスター": {
            lastName: 'メテオフォール',
            list: [
                [180, 0],
                [190, 0],
                [210, 0],
            ]
        },
        "イャンクック砲": {
            lastName: 'イャンクック大砲',
            list: [
                [120, 0],
                [140, 0],
                [150, 0],
                [180, 0],
                [200, 0],
            ]
        },
        "カホウ【烏】": {
            lastName: 'カホウ【狼】',
            list: [
                [140, 0],
                [160, 0],
                [200, 0],
                [210, 0],
            ]
        },
        "バイナクルラ": {
            lastName: '眠砲公爵コシュマル',
            list: [
                [120, 5],
                [130, 5],
                [170, 5],
                [190, 5],
            ]
        },
        "タンクメイジ": {
            lastName: 'タンクソーサラー',
            list: [
                [110, 0],
                [120, 0],
                [140, 0],
                [180, 0],
                [200, 0],
            ]
        },
        "アイススロワー": {
            lastName: 'エンバースロワー',
            list: [
                [120, 0],
                [140, 0],
                [180, 0],
                [200, 0],
            ]
        },
        "クイックキャスト": {
            lastName: 'クイックシャフト',
            list: [
                [170, 0],
                [180, 0],
                [190, 0],
            ]
        },
        "レックスハウル": {
            lastName: '轟砲【虎頭】',
            list: [
                [150, -10],
                [190, -10],
                [230, -10],
            ]
        },
        "ボーンシューター": {
            lastName: 'ボーンバスター',
            list: [
                [70, 0],
                [80, 0],
                [90, 0],
                [100, 0],
                [120, 0],
                [150, 0],
                [170, 0],
                [180, 0],
            ]
        },
        "リノマリーノ": {
            lastName: 'ディープリノマリーノ',
            list: [
                [80, 0],
                [100, 0],
                [140, 0],
                [180, 0],
                [200, 0],
            ]
        },
        "青熊筒": {
            lastName: '青熊筒【川漁】',
            list: [
                [160, 0],
                [190, 0],
                [200, 0],
            ]
        },
        "荒縄鼓砲": {
            lastName: '荒縄鼓砲【調緒】',
            list: [
                [160, 0],
                [190, 0],
                [200, 0],
            ]
        },
        "モンテベルデ": {
            lastName: '山穿ジガンラケーテ',
            list: [
                [210, 0],
                [220, 0],
                [230, 0],
            ]
        },
        "46式潜伏重砲": {
            lastName: '潜砲ハープール',
            list: [
                [110, 0],
                [120, 0],
                [140, 0],
                [180, 0],
                [200, 0],
            ]
        },
        "ラギアブリッツ": {
            lastName: '雷砲ラギアブリッツ',
            list: [
                [150, 0],
                [160, 0],
                [200, 0],
                [210, 0],
            ]
        },
        "王砲ライド": {
            lastName: '王牙砲【山雷】',
            list: [
                [150, 10],
                [190, 10],
                [210, 10],
            ]
        },
        "ディオスキャノン": {
            lastName: '爆砲アトミキャノン',
            list: [
                [150, 0],
                [200, 0],
                [210, 0],
            ]
        },
        "爆砕の重砲": {
            lastName: '破岩大砲シュライアー',
            list: [
                [210, 0],
                [220, 0],
                [230, 0],
            ]
        },
        "ユクモノ重弩": {
            lastName: 'ユクモノキャノン',
            list: [
                [100, 0],
                [110, 0],
                [130, 0],
                [170, 0],
                [190, 0],
            ]
        },
        "真ユクモノ重弩": {
            lastName: 'ユクモ連山重弩',
            list: [
                [140, 0],
                [150, 0],
                [200, 0],
                [210, 0],
            ]
        },
        "ムーファイア": {
            lastName: '霊砲ムーフレイム',
            list: [
                [110, 0],
                [120, 0],
                [130, 0],
                [170, 0],
                [190, 0],
            ]
        },
        "炎妃龍の石重弩": {
            lastName: '炎妃ガルグイユの叫喚',
            list: [
                [130, -30],
                [150, -30],
                [210, -30],
                [230, -30],
            ]
        },
        "アイルー大砲": {
            lastName: 'ネコ獣砲ニャノン',
            list: [
                [110, 0],
                [130, 0],
                [160, 0],
                [190, 0],
                [200, 0],
            ]
        },
        "狐重砲ハライニケリナ": {
            lastName: 'あしひきの山砲の御車',
            list: [
                [150, 0],
                [160, 0],
                [200, 0],
                [220, 0],
            ]
        },
        "電竜砲【進撃】": {
            lastName: '電竜砲【雷撃】',
            list: [
                [150, 10],
                [160, 10],
                [200, 10],
                [220, 10],
            ]
        },
        "巨獣砲": {
            lastName: '巨撃・爆砲ォー遠',
            list: [
                [160, -10],
                [180, -10],
                [230, -10],
                [240, -10],
            ]
        },
        "灼炎のイグナー": {
            lastName: '斬竜砲エクリプス',
            list: [
                [160, 0],
                [170, 0],
                [210, 0],
                [230, 0],
            ]
        },
        "トリガーofハザード": {
            lastName: 'トリガーofデマイズ',
            list: [
                [150, 20],
                [190, 20],
                [210, 20],
            ]
        },
        "THEディザスター": {
            lastName: 'THEフェイス',
            list: [
                [200, 30],
                [210, 30],
                [220, 30],
            ]
        },
        "デルフ＝ダオラ": {
            lastName: 'グラン＝ダオラ',
            list: [
                [150, 10],
                [160, 10],
                [210, 10],
                [230, 10],
            ]
        },
        "天秤といふ名の白骸": {
            lastName: '白骸の罪砲',
            list: [
                [160, 0],
                [200, 0],
                [210, 0],
                [220, 0],
            ]
        },
        "極星砲ヴィズィ": {
            lastName: '悲哀ナル砲星ヴィズィ',
            list: [
                [180, 10],
                [190, 10],
                [200, 15],
            ]
        },
        "海造砲【火刃】": {
            lastName: '海造砲【炎刃】',
            list: [
                [150, 0],
                [190, 0],
                [210, 0],
            ]
        },
        "ブラックキャノン": {
            lastName: 'クロノキャノン',
            list: [
                [140, 0],
                [150, 0],
                [200, 0],
                [210, 0],
            ]
        },
        "ズッカカロッツァ": {
            lastName: 'サンドリヨン',
            list: [
                [150, 0],
                [190, 0],
                [200, 0],
            ]
        },
        "ブルームスター": {
            lastName: 'ミーティア',
            list: [
                [180, 0],
                [190, 0],
                [200, 0],
            ]
        },
        "ナナホシ大砲": {
            lastName: 'ナナホシ天砲',
            list: [
                [180, 0],
                [190, 0],
                [200, 0],
            ]
        },
        "暴食の重弩": {
            lastName: 'アンフィニグラ',
            list: [
                [200, -10],
                [210, -10],
                [220, -10],
            ]
        },
        "業重弩ファミン": {
            lastName: '滅重弩ガジンファミン',
            list: [
                [220, -15],
                [230, -15],
                [240, -15],
            ]
        },
        "ヒーローブラスター": {
            lastName: 'マスターブラスター',
            list: [
                [160, 40],
                [180, 40],
                [190, 40],
            ]
        },
        "カーマエレオーン": {
            lastName: 'カーマヒトバーレ',
            list: [
                [210, 0],
                [220, 0],
                [230, 0],
            ]
        },
        "テオ＝アーティレリ": {
            lastName: 'テオ＝フランマルス',
            list: [
                [210, 5],
                [220, 5],
                [230, 5],
            ]
        },
        "覇砲ユプカムトルム": {
            lastName: '覇轟砲クーネユプカム',
            list: [
                [210, 40],
                [210, 40],
                [220, 40],
            ]
        },
        "崩砲バセカムルバス": {
            lastName: '崩天砲パセカオンカム',
            list: [
                [240, -30],
                [250, -30],
                [260, -30],
            ]
        },
        "凶刻【時雨】": {
            lastName: '天嵐ノ刻【刻露清秀】',
            list: [
                [210, -5],
                [220, -5],
                [230, -5],
            ]
        },
        "カオスウイング": {
            lastName: '神滅弩アル・エリア',
            list: [
                [210, 10],
                [220, 10],
                [230, 10],
            ]
        },
        "紅熊轟筒": {
            lastName: '紅熊大轟筒【怪腕】',
            list: [
                [90, 0],
                [100, 0],
                [110, 0],
                [130, 0],
                [140, 0],
                [170, 0],
                [180, 0],
                [190, 0],
                [200, 0],
                [210, 0],
            ]
        },
        "エオストペンギーゴ": {
            lastName: 'エオストペングルス',
            list: [
                [90, 0],
                [100, 0],
                [110, 0],
                [130, 0],
                [140, 0],
                [170, 0],
                [180, 0],
                [190, 0],
                [200, 0],
                [210, 0],
            ]
        },
        "ウィルガバスター": {
            lastName: '黒甲ウィルガバスター',
            list: [
                [90, 0],
                [100, 0],
                [110, 0],
                [130, 0],
                [140, 0],
                [170, 0],
                [180, 0],
                [190, 0],
                [200, 0],
                [210, 0],
            ]
        },
        "紫毒姫竜砲": {
            lastName: '紫毒姫竜砲【華撃】',
            list: [
                [90, 0],
                [100, 0],
                [110, 0],
                [130, 0],
                [140, 0],
                [160, 0],
                [170, 0],
                [180, 0],
                [190, 0],
                [200, 0],
            ]
        },
        "黒縄鬼砲": {
            lastName: '黒縄鬼砲【注連】',
            list: [
                [120, 0],
                [130, 0],
                [140, 0],
                [150, 0],
                [190, 0],
                [190, 0],
                [200, 0],
                [200, 0],
                [210, 0],
                [210, 0],
            ]
        },
        "ラファガスナイパー": {
            lastName: '暁砲【瑞風】',
            list: [
                [170, 20],
                [170, 30],
                [180, 20],
                [180, 30],
                [190, 20],
                [190, 30],
                [200, 20],
                [200, 30],
                [210, 20],
                [210, 30],
            ]
        },
        "グロボ＝ショット": {
            lastName: 'グロボ＝バールゼタ',
            list: [
                [180, -20],
                [180, -10],
                [190, -20],
                [190, -10],
                [200, -20],
                [200, -10],
                [210, -20],
                [210, -10],
                [220, -20],
                [220, -10],
            ]
        },
        "カホウ【禍】": {
            lastName: '隻眼公のカホウ',
            list: [
                [160, 0],
                [170, 0],
                [180, 0],
                [190, 0],
                [200, 0],
                [200, 0],
                [210, 0],
                [210, 0],
                [210, 0],
                [210, 0],
            ]
        },
        "金狼砲ライド": {
            lastName: '金狼牙砲【山雷】',
            list: [
                [160, 10],
                [170, 10],
                [180, 10],
                [190, 10],
                [200, 10],
                [200, 20],
                [210, 10],
                [210, 20],
                [220, 10],
                [220, 20],
            ]
        },
        "ルドラハウル": {
            lastName: '鉤爪砲【荒虎頭】',
            list: [
                [180, -20],
                [180, -10],
                [190, -20],
                [190, -10],
                [200, -20],
                [200, -10],
                [210, -20],
                [210, -10],
                [220, -20],
                [220, -10],
            ]
        },
        "爆焔のイグナー": {
            lastName: '燼滅砲エクリクス',
            list: [
                [180, 0],
                [190, 0],
                [200, 0],
                [200, 0],
                [210, 0],
                [210, 0],
                [220, 0],
                [220, 0],
                [230, 0],
                [230, 0],
            ]
        },
        "海賊Ｊキャノン": {
            lastName: '大海賊Jキャノン',
            list: [
                [190, 0],
                [200, 0],
                [210, 0],
            ]
        }
    }
}