namespace weaponList {
    export const lightbowgun = {
        "ベルダーバレット": {
            lastName: 'サージュバレット',
            list: [
                [80, 0],
                [90, 0],
                [100, 0],
                [110, 0],
                [130, 0],
                [150, 0],
                [190, 0],
                [210, 0],
            ]
        },
        "クックアンガ―": {
            lastName: 'クックカウンター',
            list: [
                [120, 0],
                [130, 0],
                [140, 0],
                [170, 0],
                [190, 0],
                [200, 0],
            ]
        },
        "ド【烏】": {
            lastName: 'ド【狼】',
            list: [
                [150, 5],
                [160, 5],
                [170, 5],
                [190, 5],
                [210, 5],
            ]
        },
        "ド【兇】": {
            lastName: '黒狼隊のショウド',
            list: [
                [190, 30],
                [200, 30],
                [210, 30],
            ]
        },
        "テイルストリング": {
            lastName: 'テイルカタパルト',
            list: [
                [130, 0],
                [160, 0],
                [170, 0],
                [190, 0],
                [200, 0],
            ]
        },
        "ロンナークプシカ": {
            lastName: 'ロンベルチャカリオ',
            list: [
                [170, 0],
                [190, 0],
                [200, 0],
                [210, 0],
            ]
        },
        "テイルブリザード": {
            lastName: 'テイルアヴァランチ',
            list: [
                [170, 10],
                [180, 10],
                [190, 10],
            ]
        },
        "ヴァルキリーファイア": {
            lastName: 'ヴァルキリーブレイズ',
            list: [
                [120, 0],
                [130, 0],
                [140, 0],
                [150, 0],
                [170, 0],
                [200, 0],
                [210, 0],
                [220, 0],
            ]
        },
        "繚乱の対弩": {
            lastName: '金華朧銀の対弩',
            list: [
                [210, 0],
                [220, 0],
                [230, 0],
            ]
        },
        "ディオスブラスト": {
            lastName: '爆弩コバルトブラスト',
            list: [
                [150, 0],
                [170, 0],
                [200, 0],
                [210, 0],
            ]
        },
        "爆砕の光弩": {
            lastName: '破岩弩バリスタイト',
            list: [
                [210, 0],
                [220, 0],
                [230, 0],
            ]
        },
        "オブシドバレット": {
            lastName: '歴耀弩デボニア',
            list: [
                [150, 0],
                [170, 0],
                [200, 0],
                [220, 0],
            ]
        },
        "幻獣筒【三ツ角】": {
            lastName: '幻獣筒【三界三禍】',
            list: [
                [140, 0],
                [160, 0],
                [180, 0],
                [200, 0],
            ]
        },
        "飛雷弩": {
            lastName: '撃雷弩【麒麟】',
            list: [
                [190, 0],
                [200, 0],
                [210, 0],
            ]
        },
        "ハンターライフル": {
            lastName: 'スナイプシューター',
            list: [
                [70, 0],
                [80, 0],
                [110, 0],
                [120, 0],
                [140, 0],
                [170, 0],
                [200, 0],
                [200, 0],
            ]
        },
        "フルットシリンジ": {
            lastName: 'フルーミィシリンジ',
            list: [
                [120, 0],
                [140, 0],
                [160, 0],
                [200, 0],
                [210, 0],
            ]
        },
        "クゥイルバースト": {
            lastName: 'キングルバースト',
            list: [
                [100, 0],
                [110, 0],
                [150, 0],
                [170, 0],
                [200, 0],
                [210, 0],
            ]
        },
        "ショットボウガン・白": {
            lastName: 'バレットシャワー・白',
            list: [
                [90, 10],
                [110, 10],
                [120, 10],
                [150, 10],
                [160, 10],
                [200, 10],
            ]
        },
        "ショットボウガン・蛇": {
            lastName: 'バレットシャワー・蛇',
            list: [
                [130, 0],
                [150, 0],
                [180, 0],
                [200, 0],
            ]
        },
        "ショットボウガン・蒼": {
            lastName: 'バレットシャワー・蒼',
            list: [
                [160, 20],
                [180, 20],
                [190, 20],
                [200, 20],
            ]
        },
        "ショットボウガン・碧": {
            lastName: 'バレットシャワー・碧',
            list: [
                [170, 0],
                [200, 0],
                [210, 0],
            ]
        },
        "ショットボウガン・紅": {
            lastName: 'バレットシャワー・紅',
            list: [
                [190, 0],
                [200, 0],
                [210, 0],
            ]
        },
        "ウロコトルネード": {
            lastName: '溶岩弩ウログルト',
            list: [
                [130, 0],
                [150, 0],
                [180, 0],
                [200, 0],
            ]
        },
        "王弩ライカン": {
            lastName: '王牙弩【野雷】',
            list: [
                [150, 10],
                [170, 10],
                [190, 10],
                [200, 10],
                [220, 10],
            ]
        },
        "ラサーサアルシアラ": {
            lastName: '叛弩アルシアラ',
            list: [
                [150, 10],
                [160, 10],
                [210, 10],
                [220, 10],
            ]
        },
        "叛逆の旋弩": {
            lastName: '叛逆弩ヴァルレギオン',
            list: [
                [220, 20],
                [230, 20],
                [240, 20],
            ]
        },
        "ハーイゲヴァー": {
            lastName: '口裂けハーイゲヴァー',
            list: [
                [190, 0],
                [200, 0],
                [210, 0],
            ]
        },
        "ベルクーツ": {
            lastName: 'ド級弩アルデバラン',
            list: [
                [200, 0],
                [210, 0],
                [220, 0],
            ]
        },
        "クロスボウガン": {
            lastName: 'クロスブリッツ',
            list: [
                [80, 0],
                [90, 0],
                [100, 0],
                [110, 0],
                [130, 0],
                [150, 0],
                [200, 0],
                [220, 0],
            ]
        },
        "ストライプシェル": {
            lastName: '蟹甲弩ラーバルザザミ',
            list: [
                [100, 0],
                [110, 0],
                [140, 0],
                [170, 0],
                [200, 0],
            ]
        },
        "エビィーガン": {
            lastName: 'キングエビィーガン',
            list: [
                [160, 0],
                [200, 0],
                [210, 0],
            ]
        },
        "メイルシュトローム": {
            lastName: 'ネビュラシュトローム',
            list: [
                [210, 0],
                [210, 0],
                [220, 0],
            ]
        },
        "ロアルスリング": {
            lastName: 'ロアルストリーム',
            list: [
                [120, 0],
                [140, 0],
                [150, 0],
                [190, 0],
                [200, 0],
            ]
        },
        "ヒドゥンゲイズ": {
            lastName: '夜行弩【梟ノ眼】',
            list: [
                [120, 40],
                [130, 40],
                [140, 40],
                [150, 40],
                [190, 40],
            ]
        },
        "ヤクトバレット": {
            lastName: '咬弾チェイサー',
            list: [
                [140, 10],
                [150, 10],
                [190, 10],
                [210, 10],
            ]
        },
        "レックスタンク": {
            lastName: '轟弩【戦虎】',
            list: [
                [170, -20],
                [180, -20],
                [200, -20],
                [220, -10],
            ]
        },
        "シェルバレット": {
            lastName: 'インセクヴァールカン',
            list: [
                [170, 0],
                [190, 0],
                [200, 0],
            ]
        },
        "機銃ストラフィング": {
            lastName: '機銃砲バタルビトリア',
            list: [
                [200, 0],
                [210, 0],
                [220, 0],
            ]
        },
        "火竜砲": {
            lastName: '鳳仙火竜砲',
            list: [
                [140, 0],
                [150, 0],
                [170, 0],
                [190, 0],
                [200, 0],
                [210, 0],
            ]
        },
        "雷砲サンダークルス": {
            lastName: '雷迅砲サンダークルス',
            list: [
                [180, 10],
                [190, 10],
                [200, 20],
            ]
        },
        "デザートストーム": {
            lastName: 'デザートテンペスト',
            list: [
                [170, 0],
                [190, 0],
                [210, 0],
            ]
        },
        "ラヴァシュトローム": {
            lastName: 'ラヴァストーム',
            list: [
                [190, 0],
                [200, 0],
                [210, 0],
            ]
        },
        "ユクモノ弩": {
            lastName: 'ユクモノバレット',
            list: [
                [110, 0],
                [120, 0],
                [140, 0],
                [180, 0],
                [200, 0],
            ]
        },
        "真ユクモノ弩": {
            lastName: 'ユクモ霊弩【弾雨】',
            list: [
                [180, 0],
                [200, 0],
                [210, 0],
            ]
        },
        "アイルーラグドール": {
            lastName: 'アイルーヘルドール',
            list: [
                [120, 0],
                [130, 0],
                [140, 0],
                [170, 0],
                [190, 0],
            ]
        },
        "メラルーラグドール": {
            lastName: 'メラルーヘルドール',
            list: [
                [120, 30],
                [130, 30],
                [150, 30],
                [180, 30],
                [190, 30],
            ]
        },




        "吹吹茶釜": {
            lastName: '吹吹チャガンマン',
            list: [
                [160, 0],
                [190, 0],
                [210, 0],
            ]
        },
        "クロオビボウガン": {
            lastName: 'シハンボウガン',
            list: [
                [130, 0],
                [150, 0],
                [190, 0],
                [210, 0],
            ]
        },
        "フィオシダーレ": {
            lastName: 'ノブレスオーダー',
            list: [
                [140, 10],
                [150, 10],
                [180, 15],
                [200, 15],
            ]
        },
        "ビートスナイパー": {
            lastName: 'ペネトレートビート',
            list: [
                [140, 0],
                [160, 0],
                [190, 0],
                [200, 0],
            ]
        },
        "春夜鯉砲": {
            lastName: '春夜鯉砲【滝登り】',
            list: [
                [130, 0],
                [150, 0],
                [180, 0],
                [200, 0],
            ]
        },
        "気艦銃": {
            lastName: '気艦銃バルヘリス',
            list: [
                [140, 0],
                [150, 0],
                [180, 0],
                [200, 0],
            ]
        },
        "ビューベル": {
            lastName: '高原のフリューベル',
            list: [
                [100, 10],
                [120, 10],
                [150, 10],
                [160, 10],
            ]
        },
        "エルドラマスケット": {
            lastName: '亡国の宝銃バイジン',
            list: [
                [130, 10],
                [150, 15],
                [190, 20],
                [210, 30],
            ]
        },
        "狐水銃シズクトキユル": {
            lastName: 'あまとぶや軽弩の水珠',
            list: [
                [150, 0],
                [170, 0],
                [200, 0],
                [210, 0],
            ]
        },
        "電竜弩": {
            lastName: 'サージ電竜砲',
            list: [
                [150, 0],
                [170, 0],
                [200, 0],
                [210, 0],
            ]
        },
        "巨獣弩": {
            lastName: '巨弾・弩ッ弩ッ弩ッ',
            list: [
                [160, 0],
                [180, 0],
                [220, 0],
                [240, 0],
            ]
        },
        "灼炎のエンサー": {
            lastName: '斬竜弩イクリール',
            list: [
                [150, 0],
                [170, 0],
                [210, 0],
                [220, 0],
            ]
        },
        "レイofヴァイス": {
            lastName: 'レイofインサニティ',
            list: [
                [140, 20],
                [150, 20],
                [180, 20],
                [200, 20],
            ]
        },
        "THEオラクル": {
            lastName: 'THEバニッシャー',
            list: [
                [190, 35],
                [200, 35],
                [210, 35],
            ]
        },
        "ウラナイランプ": {
            lastName: 'マジナイランプ',
            list: [
                [140, 30],
                [180, 30],
                [200, 30],
                [210, 30],
            ]
        },
        "巨蟹といふ名の白骸": {
            lastName: '白骸の怪弩',
            list: [
                [160, 0],
                [170, 0],
                [210, 0],
                [220, 0],
            ]
        },
        "極星弩グラーグ": {
            lastName: '驚嘆ナル弩星グラーグ',
            list: [
                [200, 10],
                [210, 10],
                [220, 10],
            ]
        },
        "ブラックパラソル": {
            lastName: 'クロノパラソル',
            list: [
                [150, 0],
                [170, 0],
                [190, 0],
                [200, 0],
            ]
        },
        "パールフリルパラソル": {
            lastName: 'パールセレブパラソル',
            list: [
                [190, 0],
                [200, 0],
                [210, 0],
            ]
        },
        "ラージャンデグ": {
            lastName: '金獅子筒【万雷】',
            list: [
                [210, -15],
                [220, -15],
                [220, -15],
            ]
        },
        "鬼神筒": {
            lastName: '鬼神筒【雷天】',
            list: [
                [220, -25],
                [230, -25],
                [240, -25],
            ]
        },
        "イビルマシーン": {
            lastName: 'マッドネスグリーフ',
            list: [
                [190, -10],
                [200, -10],
                [210, -10],
            ]
        },
        "瓢弾": {
            lastName: '瓢弾【千成】',
            list: [
                [180, 0],
                [190, 0],
                [200, 0],
                [210, 0],
            ]
        },
        "業弩ダークデメント": {
            lastName: '滅弩ダークデメント',
            list: [
                [220, -15],
                [230, -15],
                [240, -15],
            ]
        },
        "鋼氷蜂弩": {
            lastName: 'ホーネス＝ダオラ',
            list: [
                [210, 10],
                [220, 10],
                [230, 10],
            ]
        },
        "シルバースパルタカス": {
            lastName: '朧銀の連弩',
            list: [
                [210, -10],
                [220, -10],
                [230, -10],
            ]
        },
        "ゴールドヴァルキリー": {
            lastName: '金華の連弩',
            list: [
                [200, 0],
                [210, 0],
                [220, 0],
            ]
        },
        "崩弩エイヌカムルバス": {
            lastName: '崩天弩エイヌオンカム',
            list: [
                [240, -30],
                [250, -30],
                [260, -30],
            ]
        },
        "凶針【水禍】": {
            lastName: '天嵐ノ針【水天一色】',
            list: [
                [200, -10],
                [210, -10],
                [220, -10],
            ]
        },
        "鬼ヶ島": {
            lastName: '大鬼ヶ島',
            list: [
                [130, 0],
                [150, 0],
                [160, 0],
                [190, 0],
                [200, 0],
            ]
        },
        "神ヶ島": {
            lastName: '大神ヶ島【出雲】',
            list: [
                [200, 0],
                [210, 0],
                [220, 0],
            ]
        },
        "レギーナファイア": {
            lastName: 'レギーナフレイムロゼ',
            list: [
                [120, 0],
                [130, 0],
                [140, 0],
                [170, 0],
                [180, 0],
                [190, 0],
                [200, 0],
                [210, 0],
                [220, 0],
                [220, 0],
            ]
        },
        "ラファガゲイズ": {
            lastName: '黎明弩【鷹ノ眼】',
            list: [
                [160, 30],
                [160, 40],
                [170, 30],
                [170, 40],
                [180, 30],
                [180, 40],
                [190, 30],
                [190, 40],
                [200, 30],
                [200, 40],
            ]
        },
        "ド【禍】": {
            lastName: '隻眼隊のショウド',
            list: [
                [170, 20],
                [170, 30],
                [180, 20],
                [180, 30],
                [190, 20],
                [190, 30],
                [200, 20],
                [200, 30],
                [210, 20],
                [210, 30],
            ]
        },
        "黒炎竜砲": {
            lastName: '慟黒炎竜砲',
            list: [
                [180, 0],
                [180, 0],
                [190, 0],
                [190, 0],
                [200, 0],
                [200, 0],
                [210, 0],
                [210, 0],
                [220, 0],
                [220, 0],
            ]
        },
        "金狼弩ライカン": {
            lastName: '金狼牙弩【野雷】',
            list: [
                [180, 10],
                [190, 5],
                [190, 10],
                [200, 5],
                [210, 5],
                [210, 10],
                [220, 5],
                [220, 10],
                [230, 5],
                [230, 10],
            ]
        },
        "ルドラゾフル": {
            lastName: '鉤爪弩【荒虎掌】',
            list: [
                [190, -20],
                [190, -10],
                [200, -20],
                [200, -10],
                [210, -20],
                [210, -10],
                [220, -20],
                [220, -10],
                [230, -20],
                [230, -10],
            ]
        },
        "爆焔のエンサー": {
            lastName: '燼滅弩イクリール',
            list: [
                [170, 0],
                [180, 0],
                [190, 0],
                [200, 0],
                [200, 0],
                [210, 0],
                [210, 0],
                [220, 0],
                [220, 0],
                [230, 0],
            ]
        },
        "アームキャノン": {
            lastName: 'アームキャノンX',
            list: [
                [190, 0],
                [200, 0],
                [210, 0],
            ]
        }
    }
}